app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "address", "city", "state", "zip", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save