app/controllers/reviews_controller.rb

  def new
    @review = Review.new
    @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

  def create
    @review = Review.new(review_params)
    @restaurant = Restaurant.find(params[:restaurant_id])

    if @review.save
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
INSERT INTO "reviews" ("restaurant_id", "body", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["restaurant_id", 32], ["body", "This is a raving review!"], ["rating", 5], ["created_at", 2017-07-14 15:05:17 UTC], ["updated_at", 2017-07-14 15:05:17 UTC]]